<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML>
 <HEAD>
   <TITLE> [deepamehta-devel] M&#246;gliches Entwicklertreffen
   </TITLE>
   <LINK REL="Index" HREF="http://lists.berlios.de/pipermail/deepamehta-devel/2009-January/index.html" >
   <LINK REL="made" HREF="mailto:deepamehta-devel%40lists.berlios.de?Subject=Re%3A%20%5Bdeepamehta-devel%5D%20%3D%3Futf-8%3Fq%3FM%3DC3%3DB6gliches_Entwicklertreffen%3F%3D&In-Reply-To=%3C495F5C89.1010500%40deepamehta.de%3E">
   <META NAME="robots" CONTENT="index,nofollow">
   <style type="text/css">
       pre {
           white-space: pre-wrap;       /* css-2.1, curent FF, Opera, Safari */
           }
   </style>
   <META http-equiv="Content-Type" content="text/html; charset=us-ascii">
   
   <LINK REL="Next"  HREF="000308.html">
 </HEAD>
 <BODY BGCOLOR="#ffffff">
   <H1>[deepamehta-devel] M&#246;gliches Entwicklertreffen</H1>
    <B>Malte Rei&#223;ig</B> 
    <A HREF="mailto:deepamehta-devel%40lists.berlios.de?Subject=Re%3A%20%5Bdeepamehta-devel%5D%20%3D%3Futf-8%3Fq%3FM%3DC3%3DB6gliches_Entwicklertreffen%3F%3D&In-Reply-To=%3C495F5C89.1010500%40deepamehta.de%3E"
       TITLE="[deepamehta-devel] M&#246;gliches Entwicklertreffen">mre at deepamehta.de
       </A><BR>
    <I>Sat Jan  3 13:39:37 CET 2009</I>
    <P><UL>
        
        <LI>Next message: <A HREF="000308.html">[deepamehta-devel] PDF Topic Preview
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#307">[ date ]</a>
              <a href="thread.html#307">[ thread ]</a>
              <a href="subject.html#307">[ subject ]</a>
              <a href="author.html#307">[ author ]</a>
         </LI>
       </UL>
    <HR>  
<!--beginarticle-->
<PRE>Liebe DeepaMehta Entwickler,

die ersten Neuigkeiten des Jahres sind nicht gerade die besten aber wat
solls, wa! Wobei, doch eigentlich sind die Nachrichten gut! Denn am
19.Dezember hat keiner was verpasst :)

Also das Entwicklertreffen vom 19 Dezember ist ausgefallen. Wir sind
deshalb mit der Konzeption eines Import Features f&#252;r DeepaMehta noch
nicht weiter. Da ich diese Weiterentwicklung jedoch nebenbei weiter
vorantreiben m&#246;chte, f&#228;nde ich es gut wenn wir alsbald einen Ersatz und
Interessenten f&#252;r das Treffen organisieren k&#246;nnten. Meine ersten
Vorschl&#228;ge daf&#252;r sind z.B. der 22.,23. oder 27.Januar.

Sch&#246;nes Wochenende &amp; Lieben Gru&#223;

Malle


Malte Rei&#223;ig wrote on 19.12.2008 15:24:
&gt;<i> Hallo zusammen,
</I>&gt;<i>
</I>&gt;<i> das heutige Treffen hatte ich ja auf 18 Uhr angesetzt, jedoch kollidiert
</I>&gt;<i> das jetzt bei mir mit dem Sport. Deshalb w&#228;re es mir lieb wenn das
</I>&gt;<i> Treffen heute etwas versp&#228;tet, erst um 19 Uhr startet. Falls das
</I>&gt;<i> jemandem jetzt gar nicht passt, bitte ich um schnelle Antwort, so da&#223;
</I>&gt;<i> ich darauf noch reagieren kann.
</I>&gt;<i>
</I>&gt;<i> Lieben Gru&#223;,
</I>&gt;<i>
</I>&gt;<i> Malte
</I>&gt;<i>
</I>&gt;<i> Malte Rei&#223;ig wrote on 09.12.2008 17:29:
</I>&gt;<i>   
</I>&gt;&gt;<i> Hallo zusammen,
</I>&gt;&gt;<i>
</I>&gt;&gt;<i> das Treffen k&#246;nnte jetzt also am Freitag, den 19.12 stattfinden, so ab
</I>&gt;&gt;<i> Mittag. Jedenfalls passt dies J&#246;rg und mir. Von mir aus ginge auch der
</I>&gt;&gt;<i> Montag schon klar, das w&#228;re der 15.12 ansonsten erst wieder im neuen
</I>&gt;&gt;<i> Jahr. Bis jetzt hat sich noch kein zus&#228;tzlicher Interessent gemeldet.
</I>&gt;&gt;<i> Vielleicht interessiert das Import Thema auch nicht jedermann von uns.
</I>&gt;&gt;<i> Dazu w&#252;rde ich noch sagen wollen, das dies nicht das einzige Thema sein
</I>&gt;&gt;<i> muss, f&#252;r unseren Termin. Ich sehe da durchaus auch Platz f&#252;r eure
</I>&gt;&gt;<i> Interessen, die jetzt nicht direkt mit einem Import Feature zu tun
</I>&gt;&gt;<i> haben. Hinsichtlich der Usability und den Web-Anwendungen haben wir
</I>&gt;&gt;<i> nat&#252;rlich noch'ne Menge Raum f&#252;r jedermann der sich gerne bei uns
</I>&gt;&gt;<i> entfalten m&#246;chte ;)
</I>&gt;&gt;<i>
</I>&gt;&gt;<i> Dieses Treffen k&#246;nnen wir auch als Grundstein sehen, das anzusprechen
</I>&gt;&gt;<i> was Ihr mit J&#246;rg und mir zusammen, in den kommenden Monaten an
</I>&gt;&gt;<i> DeepaMehta verbessern wollt.
</I>&gt;&gt;<i>
</I>&gt;&gt;<i> Lieben Gru&#223;,
</I>&gt;&gt;<i>
</I>&gt;&gt;<i> Malte
</I>&gt;&gt;<i>
</I>&gt;&gt;<i>
</I>&gt;&gt;<i> Malte Rei&#223;ig wrote on 02.12.2008 15:50:
</I>&gt;&gt;<i>   
</I>&gt;&gt;<i>     
</I>&gt;&gt;&gt;<i> Hallo liebe Entwickler und DeepaMehta Freunde,
</I>&gt;&gt;&gt;<i>
</I>&gt;&gt;&gt;<i> ich f&#228;nde es sch&#246;n wenn wir uns dieses Jahr nochmal alle treffen
</I>&gt;&gt;&gt;<i> k&#246;nnten. Damit sind eigentlich alle die gemeint, die schon etwas
</I>&gt;&gt;&gt;<i> DeepaMehta Entwicklungserfahrung haben und uns bei der Konzeption von
</I>&gt;&gt;&gt;<i> einem m&#246;gl. Import Feature helfen k&#246;nnten. Uns scheint ein Teil dieses
</I>&gt;&gt;&gt;<i> Feature mit moderatem Aufwand umsetzbar zu sein und es wurde schon
</I>&gt;&gt;&gt;<i> wiederholt das Bed&#252;rfnis zum Import von Daten ge&#228;u&#223;ert.
</I>&gt;&gt;&gt;<i>
</I>&gt;&gt;&gt;<i> So wie es aktuell aussieht, k&#246;nnte die Entwicklung von zwei
</I>&gt;&gt;&gt;<i> verschiedenen Anwendungsf&#228;lle getragen und somit mit &quot;Spirit&quot; unter
</I>&gt;&gt;&gt;<i> f&#252;ttert werden. Einen davon hat Matthias M. bereits beschrieben, diesen
</I>&gt;&gt;&gt;<i> Text habe ich unten zur Orientierung mal angeh&#228;ngt. J&#246;rg und ich w&#252;rden
</I>&gt;&gt;&gt;<i> gerne mit euch zusammen in gem&#252;tlicher Runde durchsprechen inwiefern
</I>&gt;&gt;&gt;<i> solch eine Erweiterung dazu beitragen kann in Zukunft generell bessere
</I>&gt;&gt;&gt;<i> Grundlagen f&#252;r den Datenimport aufzubauen und wie erste konkrete
</I>&gt;&gt;&gt;<i> Schritte dahin aussehen m&#252;ssten.
</I>&gt;&gt;&gt;<i>
</I>&gt;&gt;&gt;<i> Wer Lust hat gibt doch bitte R&#252;ckmeldung wann daf&#252;r bei Ihm Zeit w&#228;re.
</I>&gt;&gt;&gt;<i> Mir passt es am besten in der Woche vom 15.12 bis zum 19.12 des Abends
</I>&gt;&gt;&gt;<i> am liebsten oder aber schon in der n&#228;chsten Woche, des Abends am 8.12
</I>&gt;&gt;&gt;<i> oder 9.12.
</I>&gt;&gt;&gt;<i>
</I>&gt;&gt;&gt;<i>
</I>&gt;&gt;&gt;<i> F&#252;r den 16. haben wir noch ein Community Meeting im Store geplant um die
</I>&gt;&gt;&gt;<i> Agenda vom letzten Mal nachzuholen, da gab es n&#228;mlich eine spontane
</I>&gt;&gt;&gt;<i> Einf&#252;hrungsveranstaltung. Mehr zu dem Termin unter
</I>&gt;&gt;&gt;<i> <A HREF="http://deepamehta.newthinking.net/wiki/en/Community_Agenda.">http://deepamehta.newthinking.net/wiki/en/Community_Agenda.</A> Das folgende
</I>&gt;&gt;&gt;<i> Developer Meeting k&#246;nnten wir an der Stelle ebenfalls vorbereiten,
</I>&gt;&gt;&gt;<i> bietet sich ja an. 
</I>&gt;&gt;&gt;<i>
</I>&gt;&gt;&gt;<i> Ich freue mich auf weitere Vorschl&#228;ge von euch.
</I>&gt;&gt;&gt;<i>
</I>&gt;&gt;&gt;<i> Lieben Gru&#223;
</I>&gt;&gt;&gt;<i>
</I>&gt;&gt;&gt;<i> Malte
</I>&gt;&gt;&gt;<i>
</I>&gt;&gt;&gt;<i>
</I>&gt;&gt;&gt;<i> Als Anhang nochmal die bisherigen &#220;berlegungen von Matthias und J&#246;rg f&#252;r
</I>&gt;&gt;&gt;<i> alle zum mitlesen...
</I>&gt;&gt;&gt;<i>
</I>&gt;&gt;&gt;<i> --
</I>&gt;&gt;&gt;<i>   
</I>&gt;&gt;&gt;<i>     
</I>&gt;&gt;&gt;<i>       
</I>&gt;&gt;&gt;&gt;<i> An Fragen, die diskutiert werden m&#252;ssen, sehe ich z.B.:
</I>&gt;&gt;&gt;&gt;<i>
</I>&gt;&gt;&gt;&gt;<i> - Was passiert beim Importieren von bereits vorhandenen Topics?
</I>&gt;&gt;&gt;&gt;<i> Werden diese &#252;berschrieben? Und wie kann erkannt werden, ob ein
</I>&gt;&gt;&gt;&gt;<i> Topic bereits vorhanden ist?
</I>&gt;&gt;&gt;&gt;<i>     
</I>&gt;&gt;&gt;&gt;<i>       
</I>&gt;&gt;&gt;&gt;<i>         
</I>&gt;&gt;&gt;<i> Es spricht m. E. nichts dagegen, hier die auch sonst in DeepaMehta
</I>&gt;&gt;&gt;<i> verwendete Logik zu nutzen: Abh&#228;ngig von dem Flag &quot;unique Topicname&quot;
</I>&gt;&gt;&gt;<i> (oder wie das hei&#223;t) &#252;berschreiben oder neu hinzuf&#252;gen. Beim Szenario
</I>&gt;&gt;&gt;<i> als einzelne Mindmap-/ Conceptmap-Extension wird es relativ selten
</I>&gt;&gt;&gt;<i> vorkommen, dass jemand den Zusammenhang mit dem vorhandenen
</I>&gt;&gt;&gt;<i> Datenbestand braucht. Wenn umgekehrt das &#220;berschreiben als zu gro&#223;es
</I>&gt;&gt;&gt;<i> Risiko angesehen wird, h&#228;te ich nichts gegen einen Abbriuch des Imports
</I>&gt;&gt;&gt;<i> mit Fehlermeldung, so dass man im Import-Wizard die Ascii-Daten noch
</I>&gt;&gt;&gt;<i> weiter bearbeiten kann und den Import nochmal probiert. Die Vorbereitung
</I>&gt;&gt;&gt;<i> des Inputs (vern&#252;nftig kurze und aussagekr&#228;ftige Labels, vern&#252;nftig
</I>&gt;&gt;&gt;<i> detaillierte Abstracts aus dem Rohmaterial erzeugen), die braucht
</I>&gt;&gt;&gt;<i> vermutlich sowieso mehrere Schritte mit Iteration. &#196;hnlich wie bei MS
</I>&gt;&gt;&gt;<i> Access.
</I>&gt;&gt;&gt;<i>
</I>&gt;&gt;&gt;<i>   
</I>&gt;&gt;&gt;<i>     
</I>&gt;&gt;&gt;<i>       
</I>&gt;&gt;&gt;&gt;<i> - Wie k&#246;nnen verkn&#252;pfte Topics importiert werden? Z.B. Film-Topics
</I>&gt;&gt;&gt;&gt;<i> die jeweils mehreren Schaupieler-Topics assoziiert sind.
</I>&gt;&gt;&gt;&gt;<i>     
</I>&gt;&gt;&gt;&gt;<i>       
</I>&gt;&gt;&gt;&gt;<i>         
</I>&gt;&gt;&gt;<i> 1. Verln&#252;pfungen mit schon vorhandenen Topics w&#228;ren (wie oben angedeutet)
</I>&gt;&gt;&gt;<i> nicht wichtig.
</I>&gt;&gt;&gt;<i>
</I>&gt;&gt;&gt;<i> 2. *Hierarchische* Verkn&#252;pfungen des neuen Inputs w&#228;ren eine sch&#246;ne erste
</I>&gt;&gt;&gt;<i> Ausbaustufe: Zum Beispiel die Semtech2008 Sessions zu Tracks
</I>&gt;&gt;&gt;<i> gruppieren, wie ich es auch irgendwo im UserGuide mit dem roten Topictype
</I>&gt;&gt;&gt;<i> &quot;major&quot; angedeutet habe (analog rot eingezeichneten St&#228;dten in einer
</I>&gt;&gt;&gt;<i> Landkarte neben grauen D&#246;rfern). Da diese Zuordnung aber schon in CSV
</I>&gt;&gt;&gt;<i> schwierig ist, (siehe
</I>&gt;&gt;&gt;<i> <A HREF="http://www.rzuser.uni-heidelberg.de/~x28/anke/text/#4.3.2.">http://www.rzuser.uni-heidelberg.de/~x28/anke/text/#4.3.2.</A> )
</I>&gt;&gt;&gt;<i> m&#252;sste dies der Wizard interaktiv anbieten. Ein bisschen Handarbeit
</I>&gt;&gt;&gt;<i> ist da m. E. zumutbar, da es sich wohl in der Regel h&#246;chstens um 100 - 200
</I>&gt;&gt;&gt;<i> Topics handelt.
</I>&gt;&gt;&gt;<i>
</I>&gt;&gt;&gt;<i> Wenn man sich das typische Beispiel einen Konferenz mit Sessions und Tracks
</I>&gt;&gt;&gt;<i> anschaut, oder Aufs&#228;tze mit Sammelb&#228;nden, dann ist meist der Input aus
</I>&gt;&gt;&gt;<i> einer
</I>&gt;&gt;&gt;<i> lieblos formatierten HTML-Tabelle zu entnehmen, da ist man froh, wenn man
</I>&gt;&gt;&gt;<i> &#252;berhaupt die unterste Ebene ohne Copy und Paste &#252;bernommen bekommt
</I>&gt;&gt;&gt;<i> (Copy &amp; Paste ist auch inhaltlich ein Problem, weil man dabei der
</I>&gt;&gt;&gt;<i> Versuchung
</I>&gt;&gt;&gt;<i> unterliegt, schon eine erste voreilige Filterung vorzunehmen, um
</I>&gt;&gt;&gt;<i> Handarbeit zu
</I>&gt;&gt;&gt;<i> sparen).
</I>&gt;&gt;&gt;<i>
</I>&gt;&gt;&gt;<i> F&#252;r die zweite bzw. die Gruppierungs-Ebene ist das etwas anderes. Zum
</I>&gt;&gt;&gt;<i> Beispiel
</I>&gt;&gt;&gt;<i> k&#246;nnte man diese mit in die zweispaltige Tabelle mit einreihen (Labels,
</I>&gt;&gt;&gt;<i> Descriptions)
</I>&gt;&gt;&gt;<i> und einfach als &quot;major&quot; markieren. Wenn dann das vom Import-Wizard erzeute
</I>&gt;&gt;&gt;<i> Auto-Layout die Gruppen schon mal optisch trennt (Mutter1, Kind1a, Kind1b,
</I>&gt;&gt;&gt;<i> Abstand, Mutter2, Kind2a, Kind2b, Kind2c, Abstand, Mutter3, ..) dann ist es
</I>&gt;&gt;&gt;<i> kein Problem, die Zuordnungs-Associations in dem Moment zu machen, wo man
</I>&gt;&gt;&gt;<i> auch inhaltlich die Topics verarbeitet, z. B. Fulltext-Descriptions
</I>&gt;&gt;&gt;<i> liest und per
</I>&gt;&gt;&gt;<i> Fettsatz annotiert.
</I>&gt;&gt;&gt;<i>
</I>&gt;&gt;&gt;<i> (Sch&#246;n w&#228;re es an dieser Stelle nat&#252;rlich, wenn dabei eine farblich
</I>&gt;&gt;&gt;<i> st&#228;rkere Linie
</I>&gt;&gt;&gt;<i> der Standard w&#228;re, damit das unauff&#228;lligere Grau der Generic Association
</I>&gt;&gt;&gt;<i> f&#252;r die
</I>&gt;&gt;&gt;<i> Querverweise reserviert bliebe, die zus&#228;tzlich zu den
</I>&gt;&gt;&gt;<i> Hierarchie-Relationen dazu
</I>&gt;&gt;&gt;<i> kommen).
</I>&gt;&gt;&gt;<i>
</I>&gt;&gt;&gt;<i> 3. Viele nichthierarchische Verkn&#252;pfungen wie Movies/Actors w&#228;ren erst eine
</I>&gt;&gt;&gt;<i> dritte Ausbaustufe. Die w&#228;re erstens nicht mehr soo wichtig - da w&#228;ren
</I>&gt;&gt;&gt;<i> andere
</I>&gt;&gt;&gt;<i> flankierende Verbesserungen wichtiger, um die Mapping Anwendung weiter
</I>&gt;&gt;&gt;<i> publik zu machen (etwa bei Chuck Frey oder gar Richard MacManus) , z. B.
</I>&gt;&gt;&gt;<i> eine anonyme Sandbox und ein bisschen Abrundung der Usability.
</I>&gt;&gt;&gt;<i>
</I>&gt;&gt;&gt;<i> Zweitens k&#246;nnte ein Import von komplexeren Verkn&#252;pfungen nicht mehr
</I>&gt;&gt;&gt;<i> mit viel Interaktivit&#228;t in einem Wizard ablaufen, weil die reichere
</I>&gt;&gt;&gt;<i> Funktionalit&#228;t
</I>&gt;&gt;&gt;<i> die Nutzer verwirren w&#252;rde.
</I>&gt;&gt;&gt;<i>
</I>&gt;&gt;&gt;<i> Hier k&#228;me deshalb eher infrage, ein bestimmtes XML-Format komplett
</I>&gt;&gt;&gt;<i> umzusetzen, etwas die RDF-Datei der Semtech2008 Sessions, oder, aus
</I>&gt;&gt;&gt;<i> dem Literaturbereich, etwas wie Beluga-Output
</I>&gt;&gt;&gt;<i>  <A HREF="http://beluga.sub.uni-hamburg.de/">http://beluga.sub.uni-hamburg.de/</A> , n&#228;mlich IMS/Scorm-Pakete, oder
</I>&gt;&gt;&gt;<i> vielleicht gibt es bei Endnote auch Schnittstellen zum Anzapfen. Oder auch
</I>&gt;&gt;&gt;<i> Concept-Maps von Novaks Cmap <A HREF="http://cmap.ihmc.us/conceptmap.html">http://cmap.ihmc.us/conceptmap.html</A>
</I>&gt;&gt;&gt;<i> Aber das w&#228;re eigentlich schon fast Mashup und nicht mehr nur
</I>&gt;&gt;&gt;<i> pers&#246;nliches Knowledge Management (und irgendwann w&#228;re sowas bestimmt
</I>&gt;&gt;&gt;<i> eher eine Seminararbeit f&#252;r Informatikstudenten?)
</I>&gt;&gt;&gt;<i>
</I>&gt;&gt;&gt;<i> Soweit der Import-Ablauf betroffen ist, w&#228;re hier wahrscheinlich eine
</I>&gt;&gt;&gt;<i> Transaktions-Logik das Sauberste, ganz oder gar nicht, ein neues Topic
</I>&gt;&gt;&gt;<i> mit allen Associations oder Abbruch.
</I>&gt;&gt;&gt;<i>
</I>&gt;&gt;&gt;<i> Aber, ob es sich &#252;berhaupt lohnt, &#252;ber die dritte Ausbausufe so intensiv
</I>&gt;&gt;&gt;<i> nachzudenken, das entscheidet sich e. E, erst, wenn die erste Stufe
</I>&gt;&gt;&gt;<i> Usability-m&#228;&#223;ig vertrauenerweckend aussieht. So viel erstmal f&#252;r heute.
</I>&gt;&gt;&gt;<i>   
</I>&gt;&gt;&gt;<i>     
</I>&gt;&gt;&gt;<i>       
</I>&gt;&gt;<i> _______________________________________________
</I>&gt;&gt;<i> deepamehta-devel mailing list
</I>&gt;&gt;<i> <A HREF="https://lists.berlios.de/mailman/listinfo/deepamehta-devel">deepamehta-devel at lists.berlios.de</A>
</I>&gt;&gt;<i> <A HREF="https://lists.berlios.de/mailman/listinfo/deepamehta-devel">https://lists.berlios.de/mailman/listinfo/deepamehta-devel</A>
</I>&gt;&gt;<i>   
</I>&gt;&gt;<i>     
</I>&gt;<i>
</I>&gt;<i> _______________________________________________
</I>&gt;<i> deepamehta-devel mailing list
</I>&gt;<i> <A HREF="https://lists.berlios.de/mailman/listinfo/deepamehta-devel">deepamehta-devel at lists.berlios.de</A>
</I>&gt;<i> <A HREF="https://lists.berlios.de/mailman/listinfo/deepamehta-devel">https://lists.berlios.de/mailman/listinfo/deepamehta-devel</A>
</I>&gt;<i>   
</I>

</PRE>

<!--endarticle-->
    <HR>
    <P><UL>
        <!--threads-->
	
	<LI>Next message: <A HREF="000308.html">[deepamehta-devel] PDF Topic Preview
</A></li>
         <LI> <B>Messages sorted by:</B> 
              <a href="date.html#307">[ date ]</a>
              <a href="thread.html#307">[ thread ]</a>
              <a href="subject.html#307">[ subject ]</a>
              <a href="author.html#307">[ author ]</a>
         </LI>
       </UL>

<hr>
<a href="https://lists.berlios.de/mailman/listinfo/deepamehta-devel">More information about the deepamehta-devel
mailing list</a><br>
</body></html>
